from subprocess import Popen

print("=********************************************************************%--")
print(" =.                                                                   +-   ________________________")
print(" =.                                                                   +-   |                       |")
print(" =.              -*++*-    -:::.        .:::-   .::::::-.             +-   |       Программа       |")
print(" =.           -#########* -#####=      :#####:  -##########=.         +-   |  для автоматического  |")
print(" =.          *###*     :- -###=##*    .##%%##:  -###.   .=###-        +-   |       запуска         |")
print(" =.         .###*         -###.###.  .###.%##:  -###.     =##%        +-   |      пингования       |")
print(" =.         -###-         -### :###  =##: %##:  -###.     *###        +-   |        хостов         |")
print(" =.         .###*         -###  +##+*##=  %##:  -###.     =##%        +-   |                       |")
print(" =.          =###:     .. -###  .######.  %##:  -###.   .=###-        +-   |                       |")
print(" =.           +#########* -###   -####-   %##:  -##########%.         +-   |   Cmd-Ping v.0.0.1    | ")
print(" =.             .:+==+-.  .**:    -**-    :**.  .:*****:..            +-   |_______________________|")
print(" =.                                                                   +-")
print(" =.                                                                   +-")
print(" -:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::.")
# print("")
print("                   :===============================================================================*.")
print("                   *-                                                                             -+")
print("                   *-                                                                             -+")
print("                   *-                 %#######%-.  *####-    :##=     -%########:                 -+")
print(" ***********       *-                 %##+--*###%. +#####:   :##=   -####*-..:+#%.                -+")
print(" * tersero *       *-                 %##*   :###. +##+###*. :##=  -###:                          -+")
print(" *         *       *-                 %##*  .%##%. +##+.###+ :##=  =##=  .*+++++:                 -+")
print(" *  2022   *       *-                 %########+.  +##+ .###+:##=  %##=  .%#####%                 -+")
print(" ***********       *-                 %##*...      +##+  .###%##=  *###-.    *##%                 -+")
print("                   *-                 %##*         +##+   .#####=  .*####:...=##%                 -+")
print("                   *-                .%##*         +##+    .%###+    .*#########+                 -+")
print("                   *-                                                                             -+")
print("                   *-                                                                             -+")
print("                   **:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::*+")


print(100 * '-')
print('Программа для автоматического запуска пингования хостов')
while True:
    print(100 * '-')
    print('Введите последние цифры IP адреса компьютера или сервера,')
    print('в формате Y-XXX, где Y - номер подсети, а XXX - адрес узла,')
    print('если вводится только число, то по умолчанию - подсеть 1 ')
    last_digits = input('например: 0-200 или 201 (завершить - введите 0): ')
    if last_digits == '0':
        print(100 * '-')
        print('Программа завершена')
        break
    print('Старт пинга хоста 192.168.1.' + last_digits)
    full_ip = 'start ping -t 192.168.1.' + last_digits
    # print(full_ip)
    p = Popen(full_ip, shell=True)

# TODO: Сделать так, чтобы при вводе 2-201 вызывался пинг на адрес 201 во втором диапазоне, 3-201 - на 201 в третьем
#  диапазоне и т.д. 0 -5 диапазонов для работы достаточно. По умолчанию, если не вводить явно - сканировать в первом
#  диапазоне, так как вся основная техника в нем.
#  TODO: Сделать дополнительно чтобы выводилось DNS имя хоста после начала сканирования
#  TODO: Сделать проверку регулярными выражениями на плохой ввод ip типа 192.168.1.m
